Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СостояниеТраекторииОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеТраекторииОбучения</Name>
			<Comment>Текущее состояние индивидуальной траектории обучения по курсам.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбновлённыйПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяТема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Темы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Темы</Name>
			<Comment>Темы внутри курсов, иерархически подчинены справочнику Курсы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Курсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокИзучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пререквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Темы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/ТраекторияОбучения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Рекомендует следующую тему обучающемуся в рамках курса.
// Логика: ищется первая тема с не достигнутым порогом θ и со всеми выполненными пререквизитами.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//  Курс         - СправочникСсылка.Курсы - курс обучения.
//
// Возвращаемое значение:
//  СправочникСсылка.Темы, Неопределено - рекомендуемая тема или Неопределено.
//
Функция РекомендоватьСледующуюТему(Знач Пользователь, Знач Курс) Экспорт
    
    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Темы.Ссылка                            КАК Тема,
        |   Темы.ПорядокИзучения                   КАК ПорядокИзучения,
        |   ЕСТЬNULL(СрезПоследних.Тета, -99)      КАК ТекущаяТета
        |ИЗ
        |   Справочник.Темы КАК Темы
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь) КАК СрезПоследних
        |       ПО СрезПоследних.Тема = Темы.Ссылка
        |ГДЕ
        |   Темы.Владелец = &Курс
        |   И НЕ Темы.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Темы.ПорядокИзучения");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Курс",         Курс);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Выборка.ТекущаяТета < ПорогТета Тогда
            Возврат Выборка.Тема;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Неопределено;
    
КонецФункции

// Рекомендует следующее задание для обучающегося в указанной теме.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//  Тема         - СправочникСсылка.Темы - тема.
//
// Возвращаемое значение:
//  СправочникСсылка.ТестовыеЗадания, Неопределено - рекомендуемое задание или Неопределено.
//
Функция РекомендоватьСледующееЗадание(Знач Пользователь, Знач Тема) Экспорт
    
    // Получить текущую θ
    ТекущаяТета = ПолучитьТекущуюТета(Пользователь, Тема);
    
    // Получить уже использованные задания (хотя бы в одной завершённой сессии)
    Использованные = ПолучитьИспользованныеЗадания(Пользователь, Тема);
    
    Кандидаты = АдаптивноеТестирование.ПолучитьКандидатовЗаданийПоТеме(Тема);
    Возврат АдаптивноеТестированиеЛокально.ВыбратьЗаданиеЛокально(
        Кандидаты, ТекущаяТета, Использованные);
    
КонецФункции

// Перестраивает индивидуальную траекторию обучения по курсу и записывает её в регистр.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//  Курс         - СправочникСсылка.Курсы - курс обучения.
//
Процедура ПересобратьТраекторию(Знач Пользователь, Знач Курс) Экспорт
    
    Темы = Новый Массив;
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Темы.Ссылка                       КАК Тема,
        |   ЕСТЬNULL(СрезПоследних.Тета, -99) КАК Тета
        |ИЗ
        |   Справочник.Темы КАК Темы
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь) КАК СрезПоследних
        |       ПО СрезПоследних.Тема = Темы.Ссылка
        |ГДЕ
        |   Темы.Владелец = &Курс
        |УПОРЯДОЧИТЬ ПО Темы.ПорядокИзучения");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Курс",         Курс);
    
    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");
    Выборка = Запрос.Выполнить().Выбрать();
    ВсегоТем = 0;
    Завершено = 0;
    ТекущаяТема = Неопределено;
    Пока Выборка.Следующий() Цикл
        ВсегоТем = ВсегоТем + 1;
        Стр = Новый Структура("Тема, Тета, Завершена", Строка(Выборка.Тема), Выборка.Тета, Выборка.Тета >= ПорогТета);
        Темы.Добавить(Стр);
        Если Выборка.Тета >= ПорогТета Тогда
            Завершено = Завершено + 1;
        ИначеЕсли ТекущаяТема = Неопределено Тогда
            ТекущаяТема = Выборка.Тема;
        КонецЕсли;
    КонецЦикла;
    
    План = Новый Структура("Темы, Создано", Темы, ТекущаяДатаСеанса());
    JSON = ОбщегоНазначенияСерверПриложение.СериализоватьВJSON(План);
    
    НаборЗаписей = РегистрыСведений.СостояниеТраекторииОбучения.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
    НаборЗаписей.Отбор.Курс.Установить(Курс);
    Запись = НаборЗаписей.Добавить();
    Запись.Пользователь       = Пользователь;
    Запись.Курс               = Курс;
    Запись.ОбновлённыйПлан    = JSON;
    Запись.ТекущаяТема        = ТекущаяТема;
    ПроцентЗавершения = 0;
    Если ВсегоТем > 0 Тогда
        ПроцентЗавершения = Завершено * 100.0 / ВсегоТем;
    КонецЕсли;
    Запись.ПроцентЗавершения  = ПроцентЗавершения;
    НаборЗаписей.Записать(Истина);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюТета(Знач Пользователь, Знач Тема)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1 СрезПоследних.Тета
        |ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь И Тема = &Тема) КАК СрезПоследних");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Тема",         Тема);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Тета;
    КонецЕсли;
    Возврат 0;

КонецФункции

Функция ПолучитьИспользованныеЗадания(Знач Пользователь, Знач Тема)
    
    Результат = Новый Соответствие;
    Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗЛИЧНЫЕ Ответы.Задание
        |ИЗ Документ.ПопыткаТеста.Ответы КАК Ответы
        |ГДЕ Ответы.Ссылка.Обучающийся = &Пользователь И Ответы.Ссылка.Тема = &Тема");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Тема",         Тема);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Вставить(Выборка.Задание, Истина);
    КонецЦикла;
    Возврат Результат;
    
КонецФункции

#КонецОбласти
